In [8]:

import pandas as pd
import numpy as np
df = pd.read_excel('Rawdata.xlsx')
df.head()

     Name          Domain       Age   Location   Salary      Exp
0    Mike   Datascience#$  34 years     Mumbai   5^00#0       2+
1  Teddy^         Testing    45' yr  Bangalore  10%%000       <3
2   Uma#r  Dataanalyst^^#       NaN        NaN  1$5%000   4> yrs
3    Jane     Ana^^lytics       NaN   Hyderbad   2000^0      NaN
4  Uttam*      Statistics     67-yr        NaN   30000-  5+ year

In [7]:
df['Name'] = df['Name'].str.replace("\W", "", regex=True)

df['Name']

<>:1: SyntaxWarning: "\W" is an invalid escape sequence. Such sequences will not work in the future. Did you mean "\\W"? A raw string is also an option.
<>:1: SyntaxWarning: "\W" is an invalid escape sequence. Such sequences will not work in the future. Did you mean "\\W"? A raw string is also an option.
/var/folders/6z/dl2_c4v120j8_v48x2txh5sm0000gn/T/ipykernel_35234/128611992.py:1: SyntaxWarning: "\W" is an invalid escape sequence. Such sequences will not work in the future. Did you mean "\\W"? A raw string is also an option.
  df['Name'] = df['Name'].str.replace("\W", "", regex=True)

0     Mike
1    Teddy
2     Umar
3     Jane
4    Uttam
5      Kim
Name: Name, dtype: str

In [12]:
df['Age'] =df['Age'].str.extract('(\\d+)')


df['Age'] = df['Age'].fillna(np.mean(pd.to_numeric(df['Age'])))
df['Age']

0       34
1       45
2    50.25
3    50.25
4       67
5       55
Name: Age, dtype: object